const myRecipes = [
    {
        id: 1,
        title: 'Маковые рулеты с творогом (4 рулета)',
        category: '🥐 Выпечка',
        subcategory: 'Сладкое',
        servings: 4,
        video: 'https://t.me/nasti_kitchen/409', 
        ingredients: [
            { name: 'Мука', amount: 700, unit: 'г' },
            { name: 'Тёплое молоко', amount: 250, unit: 'мл' },
            { name: 'Сухие быстродействующие дрожжи', amount: 11, unit: 'г' },
            { name: 'Сахар (в тесто)', amount: 100, unit: 'г' },
            { name: 'Яйца', amount: 2, unit: 'шт.' },
            { name: 'Ванильный сахар', amount: 1, unit: 'ст. л.' },
            { name: 'Сливочное масло (мягкое)', amount: 120, unit: 'г' },
            { name: 'Мак', amount: 220, unit: 'г' },
            { name: 'Сгущённое молоко', amount: 370, unit: 'г' },
            { name: 'Творог', amount: 380, unit: 'г' }
        ],
        steps: [
            "1. Тесто: В миске объединяем тёплое молоко, дрожжи, сахар, яйца, соль и ванильный сахар...",
            "2. Маковая начинка: В сотейник выливаем сгущёнку, добавляем мак и 100 мл молока...",
            "3. Творожная начинка: Творог соединяем с желтками, сахаром, ванильным сахаром и корицей.",
            "4. Формирование: Подошедшее тесто делим на 4 части, раскатываем и мажем начинкой.",
            "5. Выпекаем: При 180 °C около 35 минут. Горячие рулеты смазываем мёдом."
        ]
    }
];
