const initialRecipes = [
    {
        id: 1,
        title: "Маковые рулеты с творогом",
        emoji: "🥧",
        time: 45,
        calories: 450,
        mainCategory: "🥧 Выпечка",
        videoUrl: "",
        ingredients: [
            { name: "Мука", amount: 700, unit: "г", category: "Бакалея" },
            { name: "Творог", amount: 380, unit: "г", category: "Молочные продукты" },
            { name: "Яйца", amount: 2, unit: "шт", category: "Молочные продукты" }
        ],
        instructions: "Замесить тесто и оставить на 45 минут в теплом месте.\nПодготовить начинку из творога и мака.\nВыпекать рулеты 35 минут при 180°C."
    },
    {
        id: 2,
        title: "Стейк из лосося",
        emoji: "🐟",
        time: 15,
        calories: 350,
        mainCategory: "🐟 Основные (рыба, морепродукты)",
        videoUrl: "",
        ingredients: [
            { name: "Лосось", amount: 200, unit: "г", category: "Мясо/рыба" },
            { name: "Лимон", amount: 0.5, unit: "шт.", category: "Овощи и фрукты" }
        ],
        instructions: "1. Промой рыбу.\n2. Жарь по 5 минут с каждой стороны.\n3. Сбрызни лимоном."
    },
    {
        id: 1740129200000, 
        title: "Быстрые маринованные помидоры",
        emoji: "🍅",
        time: 35,
        calories: 85,
        mainCategory: "🥗 Салаты",
        videoUrl: "",
        ingredients: [
            { name: "Томаты", amount: 3, unit: "шт", category: "Овощи" },
            { name: "Красный сладкий лук", amount: 0.5, unit: "шт", category: "Овощи" },
            { name: "Чеснок", amount: 2, unit: "зубчика", category: "Овощи" }
        ],
        instructions: "1. Помидоры нарезаем дольками. Лук — тонкими полукольцами.\n2. Чеснок выдавливаем через пресс. \n3. Смешиваем в миске. Добавляем соль и сахар.\n4. Убираем в холодильник на 30 минут."
    },
    {
        id: 4,
        title: "Запеканка творожная с шоколадом",
        emoji: "🍫",
        time: 45,
        calories: 280,
        mainCategory: "🥧 Выпечка",
        videoUrl: "",
        ingredients: [
            { name: "Творог", amount: 500, unit: "г", category: "Молочные продукты" },
            { name: "Яйца", amount: 2, unit: "шт", category: "Молочные продукты" },
            { name: "Сахар", amount: 125, unit: "г", category: "Бакалея" },
            { name: "Соль", amount: 0.25, unit: "ч.л.", category: "Бакалея" },
            { name: "Ванилин", amount: 1, unit: "щепотка", category: "Бакалея" },
            { name: "Мука рисовая", amount: 30, unit: "г", category: "Бакалея" },
            { name: "Сметана", amount: 120, unit: "г", category: "Молочные продукты" },
            { name: "Шоколадные капли", amount: 50, unit: "г", category: "Бакалея" }
        ],
        instructions: "1. Смешать яйца с сахаром.\n2. Добавить к смеси соль, ванилин, рисовую муку, сметану, все взбить до однородности.\n3. Погружным блендером еще пробить творожную смесь.\n4. Добавить шоколадные капли.\n5. Поставить в силиконовые формы в духовку 170°C на 40-45 минут."
    }
];
